snlkuharlocal/src/Documents/ОприходованиеТМЦ/ОприходованиеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТМЦ</name>
  <comment>Оприходование ТМЦ на склад</comment>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТМЦКомиссия</registerRecords>
  <registerRecords>AccumulationRegister.СертификатныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОприходования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/СертификатныеОстатки/СертификатныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СертификатныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.ПодарочныеСертификаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ОприходованиеТМЦ/ObjectModule.bsl
//++Данилова Е.В. 15.12.2025  HELP-7617 
Перем НеКонтролироватьТА;  
//--Данилова Е.В. 15.12.2025 
Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
	
	
	
КонецПроцедуры 
 
//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
//Кухарь А.Ю.  12.02.2024 начало
// Саща попросил снять запрет на запись  Опр и Спн	
	//если НЕ ПараметрыСеанса.ЗапущенаОбработка И НЕ ОбменДанными.Загрузка И Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
	//	#Если клиент тогда
	//		Сообщить("В ЦО запрещено создание документов по виртуальным складам");
	//	#КонецЕсли
	//	отказ=Истина;
	//КонецЕсли;
//Кухарь А.Ю.  12.02.2024 конец

	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	
	//++Данилова Е.В. 03.02.2026  SNL-109 
	Если НЕ ОбменДанными.Загрузка 
		И ЕстьИзменения  Тогда 
		
		ЕстьБлокировкаПоТоварам = Обработки.ПланИнвентаризации.ЕстьблокировкаПоТоварамСклада(Склад,Товары.Выгрузить(,"Номенклатура").выгрузитьКолонку("Номенклатура")); 
		
		Если ЕстьБлокировкаПоТоварам Тогда 
			Отказ = истина;
			Сообщить("В документе присутствует заблокированная номенклатура! Документ доступен только для просмотра!");
			Возврат; 
		КонецЕсли; 	
		
	КонецЕсли;
	//--Данилова Е.В. 03.02.2026 
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
				
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
		
		// Кухарь А.Ю. 09.09.2024 начало
		ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект,,,Истина); 
		// Кухарь А.Ю. 09.09.2024 конец
		
		
	КонецЕсли; 
	
	//Кухарь 29.12.15 начало
	//Не выгружаем ни куда при перепроведении
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и ПараметрыСеанса.ОтключитьЖурнализациюЗаписи =Истина тогда
		НужноВыгружать=ложь;
	КонецЕсли;
	//Кухарь 29.12.15 конец	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	Валюта				=Неопределено;
	Курс				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
	//крохин начало 01.07.2011
	Организация = Неопределено;
	//крохин конец 01.07.2011

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	ИБ				= Основание.ИБ;
	
	// Шворобей ВЮ 20.09.2023 ++
	Если ЕстьРеквизитДокумента("Склад", Основание.Метаданные()) Тогда
		Склад = Основание.Склад;
		Если ЗначениеЗаполнено(Основание.Склад.Организация) Тогда
			Организация = Основание.Склад.Организация; 
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 20.09.2023 ++
	
	Для Каждого ИсхСтрокаТЧ Из Основание.Товары Цикл
		ТекСтрокаТЧ	=Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекСтрокаТЧ,ИсхСтрокаТЧ);	
	КонецЦикла; 
	
	//крохин начало 05.04.2012
	//в ОПР на основании РНК всегда одна статья затрат и подразделение, из РНК
	Если ВидОснования = "РасходнаяНакладная" Тогда
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230");
		Подразделение = ДокОснование.Подразделение;
    КонецЕсли;
	//крохин конец 05.04.2012
	
	//крохин начало 23.10.2012
	//в ОПР на основании РКМ всегда одна статья затрат и подразделение, из докоснования РКМ
	Если ВидОснования = "РекламационнаяНакладная" И ДокОснование.ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230");
		Подразделение = ДокОснование.ДокОснование.Подразделение;	
	КонецЕсли;
	//крохин конец 23.10.2012

КонецПроцедуры

Процедура ПровестиПоЗатратам(Записывать=Ложь) Экспорт
	//крохин начало 11.04.2013
	Если СуммаДокумента = 0 Тогда
		Возврат;
	КонецЕсли;
	//крохин конец 11.04.2013
	Движения.Затраты.Очистить();
	
	Движение=Движения.Затраты.Добавить();
	
	Движение.Период			= Дата;
	
	Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	
	Движение.Подразделение	= Подразделение;
	Движение.СтатьяЗатрат	= СтатьяЗатрат;
	
	Движение.СуммаУпр		= СуммаДокумента;	
	
	Движение.ВалютаДокумента= ПараметрыСеанса.ВалютаУпр_2009;
	Движение.СуммаДокумента	= СуммаДокумента;
	
		//крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец

	
	Движение.ДатаЗаписи		= ТекущаяДата();
	
	Если ОбменДанными.Загрузка ИЛИ Записывать Тогда
		Движения.Затраты.Записать();	
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта	=ПараметрыСеанса.ВалютаНац;
		Курс	=ПолучитьКурсВалюты_ПоРусски(Валюта,Дата); 
	КонецЕсли; 
	
	ВалютаУпр	=?(Дата >= '20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	ДвиженияПоРегистрам=Неопределено;
		
	ТС=Неопределено;	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТС);	
	
	Результат=РезультатПроведения["Результат"];
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));
	КонецЕсли;
	
	Если Отказ Тогда Возврат КонецЕсли;		
		
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);
		
	Для Каждого СтрокаТЧ Из Товары Цикл		
		СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");		
		Если СтрокаТС<>Неопределено Тогда
			СтрокаТЧ.Всего	=глПересчет(СтрокаТС.Всего,ВалютаУпр,Дата,Валюта,Курс);
			РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");	
			
			СтрокаТЧ.Цена	=глПересчет(СтрокаТС.РасчетнаяЦена,ВалютаУпр,Дата,Валюта,Курс);
		Иначе
			СтрокаТЧ.Цена	=0;
			СтрокаТЧ.Всего	=0;			
			СтрокаТЧ.НДС	=0;
			СтрокаТЧ.Сумма	=0;
		КонецЕсли;		
	КонецЦикла;	
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СуммаДокумента=Товары.Итог("Всего");	
	КонецЕсли;	
	ПровестиПоЗатратам();
	
	//кухарь учет сертификатов 11.09.13 начало
	если не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) тогда
		отказ=Истина;
	КонецЕсли;
    //кухарь учет сертификатов 11.09.13 конец
	
	
	//крохин начало 29.12.2020
	Если Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад Тогда
    	ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
			РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, Истина);
	КонецЕсли;		
	//крохин конец 29.12.2020		

	
 	//кухарь 22.07.14 начало	
	если ОбменДанными.Загрузка тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
//кухарь 22.07.14 конец	

	
	Записать();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ПараметрыСеанса.ЗапущенаОбработка Тогда Возврат; КонецЕсли; 

	//крохин начало 10.11.2014
	//в ОПР тоже заполняем первичную группу, не разбираясь
	ЗаполнитьПервичнуюГруппуНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	//крохин конец 10.11.2014
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

//++Данилова Е.В. 15.12.2025  HELP-7617
Процедура ПеренестиРезерв() Экспорт
	НеКонтролироватьТА=Истина;
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьТА=Ложь;
КонецПроцедуры  
//--Данилова Е.В. 15.12.2025 

//++Данилова Е.В. 15.12.2025  HELP-7617 
НеКонтролироватьТА = Ложь;   
//--Данилова Е.В. 15.12.2025
